; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v3 ?v9)
             (pred_5 ?v10 ?v12)
             (pred_8 ?v3 ?v12)
             (pred_1 ?v11 ?v3 )
	     (pred_11 ?v3)
             (pred_2 ?v4)
             (pred_3 ?v10)
             (pred_9 ?v12)
             (pred_7 ?v3)
             (pred_10 ?v10)
             (pred_4 ?v3)
             (pred_6 ))



(:action op_5
:parameters (?v5 ?v1 ?v7 ?v8)
:precondition (and (pred_2 ?v5) (pred_2 ?v1) (pred_3 ?v7) (pred_9 ?v8)
          (pred_12 ?v5 ?v1) (pred_5 ?v7 ?v8)
                   (pred_8 ?v1 ?v8) (pred_11 ?v5) 
                   (pred_7 ?v1) (pred_10 ?v7))
:effect (and  (pred_4 ?v1) (not (pred_7 ?v1))))


(:action op_4
:parameters (?v5 ?v13)
:precondition (and (pred_2 ?v5) (pred_2 ?v13)
               (pred_11 ?v5) (pred_12 ?v5 ?v13) (pred_4 ?v13))
:effect (and (pred_11 ?v13) (not (pred_11 ?v5))))

(:action op_2
:parameters (?v5 ?v7)
:precondition (and (pred_2 ?v5) (pred_3 ?v7) 
                  (pred_11 ?v5) (pred_1 ?v7 ?v5) (pred_6 ))
:effect (and (pred_10 ?v7)
   (not (pred_1 ?v7 ?v5)) (not (pred_6 ))))


(:action op_1
:parameters (?v5 ?v6 ?v2)
:precondition (and (pred_2 ?v5) (pred_3 ?v6) (pred_3 ?v2)
                  (pred_11 ?v5) (pred_10 ?v2) (pred_1 ?v6 ?v5))
:effect (and (pred_10 ?v6) (pred_1 ?v2 ?v5)
        (not (pred_10 ?v2)) (not (pred_1 ?v6 ?v5))))

(:action op_3
:parameters (?v5 ?v7)
:precondition (and (pred_2 ?v5) (pred_3 ?v7) 
                  (pred_11 ?v5) (pred_10 ?v7))
:effect (and (pred_6 ) (pred_1 ?v7 ?v5) (not (pred_10 ?v7)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_16 obj_13 obj_07 obj_04 obj_08 obj_05 obj_10 obj_19 obj_06 obj_12 obj_17 obj_14 obj_20 obj_03 obj_09 obj_01
    obj_11 obj_18
    obj_02 obj_15
    )

    (:init
       (pred_6)

       (pred_2 obj_16)
       (pred_2 obj_13)
       (pred_2 obj_07)
       (pred_2 obj_04)
       (pred_2 obj_08)
       (pred_2 obj_05)
       (pred_2 obj_10)
       (pred_2 obj_19)
       (pred_2 obj_06)
       (pred_2 obj_12)
       (pred_2 obj_17)
       (pred_2 obj_14)
       (pred_2 obj_20)
       (pred_2 obj_03)
       (pred_2 obj_09)
       (pred_2 obj_01)
       (pred_9 obj_11)
       (pred_9 obj_18)
       (pred_3 obj_02)
       (pred_3 obj_15)

       (pred_12 obj_16 obj_08)
       (pred_12 obj_16 obj_13)
       (pred_12 obj_13 obj_05)
       (pred_12 obj_13 obj_07)
       (pred_12 obj_13 obj_16)
       (pred_12 obj_07 obj_10)
       (pred_12 obj_07 obj_04)
       (pred_12 obj_07 obj_13)
       (pred_12 obj_04 obj_19)
       (pred_12 obj_04 obj_07)
       (pred_12 obj_08 obj_06)
       (pred_12 obj_08 obj_05)
       (pred_12 obj_08 obj_16)
       (pred_12 obj_05 obj_12)
       (pred_12 obj_05 obj_10)
       (pred_12 obj_05 obj_13)
       (pred_12 obj_05 obj_08)
       (pred_12 obj_10 obj_17)
       (pred_12 obj_10 obj_19)
       (pred_12 obj_10 obj_07)
       (pred_12 obj_10 obj_05)
       (pred_12 obj_19 obj_14)
       (pred_12 obj_19 obj_04)
       (pred_12 obj_19 obj_10)
       (pred_12 obj_06 obj_20)
       (pred_12 obj_06 obj_12)
       (pred_12 obj_06 obj_08)
       (pred_12 obj_12 obj_03)
       (pred_12 obj_12 obj_17)
       (pred_12 obj_12 obj_05)
       (pred_12 obj_12 obj_06)
       (pred_12 obj_17 obj_09)
       (pred_12 obj_17 obj_14)
       (pred_12 obj_17 obj_10)
       (pred_12 obj_17 obj_12)
       (pred_12 obj_14 obj_01)
       (pred_12 obj_14 obj_19)
       (pred_12 obj_14 obj_17)
       (pred_12 obj_20 obj_03)
       (pred_12 obj_20 obj_06)
       (pred_12 obj_03 obj_09)
       (pred_12 obj_03 obj_12)
       (pred_12 obj_03 obj_20)
       (pred_12 obj_09 obj_01)
       (pred_12 obj_09 obj_17)
       (pred_12 obj_09 obj_03)
       (pred_12 obj_01 obj_14)
       (pred_12 obj_01 obj_09)
       (pred_7 obj_20)
       (pred_7 obj_05)
       (pred_8  obj_20 obj_11)
       (pred_8  obj_05 obj_18)
       (pred_4 obj_16)
       (pred_4 obj_13)
       (pred_4 obj_07)
       (pred_4 obj_04)
       (pred_4 obj_08)
       (pred_4 obj_10)
       (pred_4 obj_19)
       (pred_4 obj_06)
       (pred_4 obj_12)
       (pred_4 obj_17)
       (pred_4 obj_14)
       (pred_4 obj_03)
       (pred_4 obj_09)
       (pred_4 obj_01)

       (pred_5  obj_02 obj_11)
       (pred_5  obj_15 obj_18)
       (pred_1 obj_02 obj_09)
       (pred_1 obj_15 obj_04)
       (pred_11 obj_19)
    )

    (:goal (and
       (pred_1 obj_15 obj_17)
    ))
(:constraints
  (always (not (pred_11 obj_10)))
)
)

; plan
1. (op_4 obj_19 obj_04)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_04)
   goals met: 0 of 1
2. (op_2 obj_04 obj_15)
   deleted: (pred_1 obj_15 obj_04) (pred_6)
   added: (pred_10 obj_15)
   goals met: 0 of 1
3. (op_4 obj_04 obj_19)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_19)
   goals met: 0 of 1
4. (op_4 obj_19 obj_14)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_14)
   goals met: 0 of 1
5. (op_4 obj_14 obj_17)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_17)
   goals met: 0 of 1
6. (op_3 obj_17 obj_15)
   deleted: (pred_10 obj_15)
   added: (pred_6) (pred_1 obj_15 obj_17)
   goals met: 1 of 1
